In [1]:
import pandas as pd
import sqlite3

In [2]:
con = sqlite3.connect('db')

In [91]:
data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

In [92]:
employee.to_sql('employee', con, index=False, if_exists='replace')

3

In [67]:
sql = 'select * from employee'

In [38]:
pd.read_sql(sql, con)

   id  salary
0   1     100
1   2     200
2   3     300

In [68]:
sql = '''
    select
        MAX(salary) as SecondHighestSalary
    from employee
    where salary < (select MAX(salary) from employee)
'''

In [93]:
pd.read_sql(sql, con)

   SecondHighestSalary
0                  200